iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H747I-EVAL/stm32h747i_eval_lcd.c
  if(Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    LCD_DeInitSequence();
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 0)
    LTDC_MspDeInit(&hlcd_ltdc);
#endif /* (USE_HAL_LTDC_REGISTER_CALLBACKS == 0) */

    DMA2D_MspDeInit(&hlcd_dma2d);

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 0)
    DSI_MspDeInit(&hlcd_dsi);
#endif /* (USE_HAL_DSI_REGISTER_CALLBACKS == 0) */
    if(HAL_DSI_DeInit(&hlcd_dsi) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      (void)HAL_LTDC_DeInit(&hlcd_ltdc);
      if(HAL_DMA2D_DeInit(&hlcd_dma2d) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        Lcd_Ctx[Instance].IsMspCallbacksValid = 0;
      }
    }
  }

  return ret;
}

/**
  * @brief  Initializes the LCD HDMI Mode.
  * @param  Instance    LCD Instance
  * @param  Format      HDMI format could be HDMI_FORMAT_720_480 or HDMI_FORMAT_720_576
  * @retval BSP status
  */
int32_t BSP_LCD_InitHDMI(uint32_t Instance, uint32_t Format)
{
  int32_t ret;
  DSI_PLLInitTypeDef    dsiPllInit;
  DSI_PHY_TimerTypeDef  dsiPhyInit;
  MX_LTDC_LayerConfig_t hdmi_config;
  LCD_HDMI_Timing_t     hdmi_timing;
  DSI_VidCfgTypeDef     hDsiVideoMode;

  if(Instance >= LCD_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    LCD_Get_HDMI_VideoModeTiming(Format, &hdmi_timing);
    Lcd_Ctx[Instance].XSize       = hdmi_timing.HACT;
    Lcd_Ctx[Instance].YSize       = hdmi_timing.VACT;
    Lcd_Ctx[Instance].PixelFormat = LCD_PIXEL_FORMAT_RGB888;
    Lcd_Ctx[Instance].BppFactor = 4U;

    /* Toggle Hardware Reset of the DSI LCD using
    * its XRES signal (active low) */
    BSP_LCD_Reset(Instance);

    /* Initializes peripherals instance value */
    hlcd_ltdc.Instance = LTDC;
    hlcd_dma2d.Instance = DMA2D;
    hlcd_dsi.Instance = DSI;

    if(ADV7533_Probe() != BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else if(Lcd_Drv->DisplayOn(Lcd_CompObj)!= BSP_ERROR_NONE)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
    else
    {
      /* Call first MSP Initialize only in case of first initialization
      * This will set IP blocks LTDC, DSI and DMA2D
      * - out of reset
      * - clocked
      * - NVIC IRQ related to IP blocks enabled
      */
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
      /* Register the LTDC MSP Callbacks */
      if(Lcd_Ctx[Instance].IsMspCallbacksValid == 0U)
      {
        if(BSP_LCD_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_PERIPH_FAILURE;
        }
      }
#else
      LTDC_MspInit(&hlcd_ltdc);
#endif

      DMA2D_MspInit(&hlcd_dma2d);

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
      /* Register the DSI MSP Callbacks */
      if(Lcd_Ctx[Instance].IsMspCallbacksValid == 0U)
      {
        if(BSP_LCD_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_PERIPH_FAILURE;
        }
      }
#else
      DSI_MspInit(&hlcd_dsi);
#endif

      /*************************DSI Initialization***********************************/
      /* Base address of DSI Host/Wrapper registers to be set before calling De-Init */
      hlcd_dsi.Instance = DSI;
      /* Set number of Lanes */
      hlcd_dsi.Init.NumberOfLanes = DSI_TWO_DATA_LANES;
      /* Set the TX escape clock division ratio */
      hlcd_dsi.Init.TXEscapeCkdiv = 3U;
      hlcd_dsi.Init.AutomaticClockLaneControl = DSI_AUTO_CLK_LANE_CTRL_DISABLE;

      /* Configure the DSI PLL */
      dsiPllInit.PLLNDIV    = 65U;
      dsiPllInit.PLLIDF     = DSI_PLL_IN_DIV5;
      dsiPllInit.PLLODF     = DSI_PLL_OUT_DIV1;
      if(HAL_DSI_Init(&hlcd_dsi, &dsiPllInit) != HAL_OK)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }

      /* Configure the D-PHY Timings */
      dsiPhyInit.ClockLaneHS2LPTime  = hdmi_timing.ClockLaneHS2LPTime;
      dsiPhyInit.ClockLaneLP2HSTime  = hdmi_timing.ClockLaneLP2HSTime;
      dsiPhyInit.DataLaneHS2LPTime   = hdmi_timing.DataLaneHS2LPTime;
      dsiPhyInit.DataLaneLP2HSTime   = hdmi_timing.DataLaneLP2HSTime;
      dsiPhyInit.DataLaneMaxReadTime = hdmi_timing.DataLaneMaxReadTime;
      dsiPhyInit.StopWaitTime        = hdmi_timing.StopWaitTime;
      if(HAL_DSI_ConfigPhyTimer(&hlcd_dsi, &dsiPhyInit) != HAL_OK)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }

      /* Timing parameters for all Video modes */
      /*
      The lane byte clock is set 40625 Khz
      The pixel clock is set to 27083 Khz
      */
      hDsiVideoMode.VirtualChannelID = 0;
      hDsiVideoMode.ColorCoding      = DSI_RGB888;
      hDsiVideoMode.LooselyPacked    = DSI_LOOSELY_PACKED_DISABLE;
      hDsiVideoMode.VSPolarity       = DSI_VSYNC_ACTIVE_LOW;
      hDsiVideoMode.HSPolarity       = DSI_HSYNC_ACTIVE_LOW;
      hDsiVideoMode.DEPolarity       = DSI_DATA_ENABLE_ACTIVE_HIGH;
      hDsiVideoMode.Mode             = DSI_VID_MODE_NB_PULSES;
      hDsiVideoMode.NullPacketSize   = 0U;
      hDsiVideoMode.NumberOfChunks   = 1U;
      hDsiVideoMode.PacketSize       = hdmi_timing.HACT; /* Value depending on display format */
      hDsiVideoMode.HorizontalSyncActive = (hdmi_timing.HSYNC * 40625U)/27083U;
      hDsiVideoMode.HorizontalBackPorch  = (hdmi_timing.HBP * 40625U)/27083U;
      hDsiVideoMode.HorizontalLine = ((hdmi_timing.HACT + hdmi_timing.HSYNC + hdmi_timing.HBP + hdmi_timing.HFP) * 40625U)/27083U; /* Value depending on display format */
      hDsiVideoMode.VerticalSyncActive        = hdmi_timing.VSYNC;
      hDsiVideoMode.VerticalBackPorch         = hdmi_timing.VBP;
      hDsiVideoMode.VerticalFrontPorch        = hdmi_timing.VFP;
      hDsiVideoMode.VerticalActive            = hdmi_timing.VACT; /* Value depending on display format */

      /* Disable or disable sending LP command while streaming is active in video mode */
      hDsiVideoMode.LPCommandEnable = DSI_LP_COMMAND_DISABLE; /* Disable sending commands in mode LP (Low Power) */

      /* Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions */
      /* Only useful when sending LP packets is allowed while streaming is active in video mode */
      hDsiVideoMode.LPLargestPacketSize     = 4;

      /* Largest packet size possible to transmit in LP mode in HFP region during VACT period */
      /* Only useful when sending LP packets is allowed while streaming is active in video mode */
      hDsiVideoMode.LPVACTLargestPacketSize = 4;

      /* Specify for each region of the video frame, if the transmission of command in LP mode is allowed in this region */
      /* while streaming is active in video mode                                                                         */
      hDsiVideoMode.LPHorizontalFrontPorchEnable = DSI_LP_HFP_DISABLE;
      hDsiVideoMode.LPHorizontalBackPorchEnable  = DSI_LP_HBP_DISABLE;
      hDsiVideoMode.LPVerticalActiveEnable       = DSI_LP_VACT_DISABLE;
      hDsiVideoMode.LPVerticalFrontPorchEnable   = DSI_LP_VFP_DISABLE;
      hDsiVideoMode.LPVerticalBackPorchEnable    = DSI_LP_VBP_DISABLE;
      hDsiVideoMode.LPVerticalSyncActiveEnable   = DSI_LP_VSYNC_DISABLE;


      /* No acknowledge at the end of a frame */
      hDsiVideoMode.FrameBTAAcknowledgeEnable    = DSI_FBTAA_DISABLE;

      /* Configure DSI Video mode timings with settings set above */
      (void)HAL_DSI_ConfigVideoMode(&(hlcd_dsi), &(hDsiVideoMode));

